tutorials/CFD/24aorta/0/Phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
228296
(
0.298029
0.297965
0.298493
0.184508
0.184782
0.184458
0.167662
0.167265
...
)
;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    descending_aorta
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet_aorta
    {
        type            zeroGradient;
    }
    third_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    first_first_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    second_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    first_second_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
