tutorials/CFD/24aorta/0/Plift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Plift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
228296
(
57.6269
57.6272
57.6546
38.6505
38.6563
38.65
36.6118
36.6132
...
)
;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    descending_aorta
    {
        type            fixedValue;
        value           uniform 1;
    }
    inlet_aorta
    {
        type            zeroGradient;
    }
    third_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    first_first_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    second_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    first_second_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
