tutorials/CFD/24aorta/0/Plift1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Plift1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
228296
(
66.6302
66.6318
66.6624
41.7977
41.8059
41.7967
38.6463
38.6454
...
)
;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    descending_aorta
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet_aorta
    {
        type            zeroGradient;
    }
    third_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    first_first_arteria
    {
        type            fixedValue;
        value           uniform 1;
    }
    second_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
    first_second_arteria
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
