tutorials/CFD/24aorta/0/Uliftx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uliftx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
228296
(
(0.187345 0 0)
(0.205397 0 0)
(0.220429 0 0)
(-0.237112 0 0)
(-0.185462 0 0)
(-0.187763 0 0)
(-0.340497 0 0)
(-0.141431 0 0)
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    descending_aorta
    {
        type            calculated;
        value           nonuniform List<vector> 
296
(
(-0.0534931 0 0)
(-0.128345 0 0)
(0.0406128 0 0)
(0.128168 0 0)
(-0.167946 0 0)
(-0.161267 0 0)
(-0.139038 0 0)
(-0.154341 0 0)
...
)
;
    }
    inlet_aorta
    {
        type            calculated;
        value           uniform (-1 0 0);
    }
    third_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0.289586 0 0)
(0.273638 0 0)
(0.100238 0 0)
(0.618338 0 0)
(-0.287426 0 0)
(-0.535273 0 0)
(4.01543 0 0)
(4.49948 0 0)
...
)
;
    }
    first_first_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
38
(
(-1.63941 0 0)
(-1.86312 0 0)
(-1.53331 0 0)
(-1.66597 0 0)
(-0.997852 0 0)
(-2.34283 0 0)
(-5.88027 0 0)
(-6.66575 0 0)
...
)
;
    }
    second_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
28
(
(4.57904 0 0)
(3.52158 0 0)
(0.00100705 0 0)
(-0.416863 0 0)
(3.64919 0 0)
(3.62147 0 0)
(3.62571 0 0)
(4.07762 0 0)
...
)
;
    }
    first_second_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
43
(
(-1.1367 0 0)
(-1.0696 0 0)
(-1.49924 0 0)
(-2.1071 0 0)
(-2.07412 0 0)
(-2.08058 0 0)
(-1.51932 0 0)
(-1.50182 0 0)
...
)
;
    }
}


// ************************************************************************* //
