tutorials/CFD/24aorta/0/Ulifty
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulifty;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
228296
(
(0 0.441929 0)
(0 0.486554 0)
(0 0.42849 0)
(0 0.726971 0)
(0 0.579826 0)
(0 0.665417 0)
(0 0.40465 0)
(0 0.419809 0)
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    descending_aorta
    {
        type            calculated;
        value           nonuniform List<vector> 
296
(
(0 -0.265257 0)
(0 -0.238317 0)
(0 -0.35857 0)
(0 -0.362377 0)
(0 -0.127233 0)
(0 -0.205831 0)
(0 -0.250452 0)
(0 -0.215515 0)
...
)
;
    }
    inlet_aorta
    {
        type            calculated;
        value           uniform (0 1 0);
    }
    third_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0 0.0634253 0)
(0 -0.0748451 0)
(0 -0.0345092 0)
(0 -0.0873407 0)
(0 -0.623279 0)
(0 -0.610534 0)
(0 -4.40823 0)
(0 -3.66427 0)
...
)
;
    }
    first_first_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
38
(
(0 -1.37135 0)
(0 -0.512726 0)
(0 0.834077 0)
(0 -0.783848 0)
(0 0.189326 0)
(0 0.35886 0)
(0 3.79678 0)
(0 2.61966 0)
...
)
;
    }
    second_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
28
(
(0 2.66602 0)
(0 2.8436 0)
(0 0.117958 0)
(0 0.601856 0)
(0 -0.449231 0)
(0 -0.246085 0)
(0 -1.18647 0)
(0 -1.09218 0)
...
)
;
    }
    first_second_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
43
(
(0 1.57974 0)
(0 0.856717 0)
(0 1.11765 0)
(0 0.288471 0)
(0 0.648297 0)
(0 0.648332 0)
(0 1.47439 0)
(0 1.64089 0)
...
)
;
    }
}


// ************************************************************************* //
