tutorials/CFD/24aorta/0/Uliftz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uliftz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
228296
(
(0 0 1.51396)
(0 0 1.62308)
(0 0 1.52617)
(0 0 -0.731889)
(0 0 -0.690585)
(0 0 -0.709924)
(0 0 -1.35762)
(0 0 -1.19411)
...
)
;

boundaryField
{
    wall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    descending_aorta
    {
        type            calculated;
        value           nonuniform List<vector> 
296
(
(0 0 -1.27586)
(0 0 -1.27849)
(0 0 -1.53482)
(0 0 -1.52041)
(0 0 -1.32823)
(0 0 -1.3174)
(0 0 -1.43412)
(0 0 -1.36367)
...
)
;
    }
    inlet_aorta
    {
        type            calculated;
        value           uniform (0 0 1);
    }
    third_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(0 0 0.980208)
(0 0 1.05009)
(0 0 2.55224)
(0 0 3.01343)
(0 0 4.90745)
(0 0 5.61137)
(0 0 8.74354)
(0 0 9.15959)
...
)
;
    }
    first_first_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
38
(
(0 0 7.18383)
(0 0 5.93169)
(0 0 6.51325)
(0 0 6.65096)
(0 0 4.72863)
(0 0 6.29535)
(0 0 5.36507)
(0 0 5.01538)
...
)
;
    }
    second_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
28
(
(0 0 11.3418)
(0 0 10.003)
(0 0 10.841)
(0 0 9.65907)
(0 0 8.39988)
(0 0 8.7155)
(0 0 8.29531)
(0 0 8.49863)
...
)
;
    }
    first_second_arteria
    {
        type            calculated;
        value           nonuniform List<vector> 
43
(
(0 0 2.10862)
(0 0 2.7623)
(0 0 3.28915)
(0 0 3.1856)
(0 0 3.56477)
(0 0 3.93073)
(0 0 3.16873)
(0 0 3.62129)
...
)
;
    }
}


// ************************************************************************* //
