tutorials/CFD/24aorta/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 15;
NmodesUproj 8;

NmodesPout 15;
NmodesPproj 8;

NmodesSUPout 15;
NmodesSUPproj 8;

timeDerivativeSchemeOrder second;

bcMethod lift;
timedepbcMethod yes;
Add_liftfieldP yes;//yes;
timedepbcMethod_P no;
Add_Windkessel_system yes;
// Output format to save market vectors.
OutPrecision 15;
OutType fixed;
