tutorials/CFD/24aorta/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;//PCG;
        //preconditioner  DICGaussSeidel;
        smoother	DICGaussSeidel;
	tolerance       1e-08;
        relTol          0.1;
    }

    /*p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }*/  


    pFinal
    {
          $p;
	  relTol 0;
    }

    Usup
    {
            solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    U
    {
        solver          PBiCGStab;//smoothSolver; //PBiCGStab;
        //smoother        symGaussSeidel;
        preconditioner	DILU;
	tolerance       1e-05;
        relTol          0;
    }


    UFinal
    {
          $U;
    }

    Phi
    {
        $p;
    }
    Plift0
    {
        $p;
    }
    Plift1
    {
        $p;
    }
    Plift2
    {
        $p;
    }
    Plift3
    {
        $p;
    }
    Plift4
    {
        $p;
    }
    Ulift
    {
        $U;
    }

}
PISO
{
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell 0;
    pRefValue 0;
    /*residualControl
    {
        Plift               1e-2;
        Ulift               1e-3;
        "(k|epsilon|omega)" 1e-3;
    }*/
}


PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
